<img class="blog-img" src="data/img/b_post9.jpg">
<h1 class="blog-title">Maker</h1>
<div class="blog-body">
<p>I am not from a family of means. I’ve seen Jam on the table disappear often as a part of budget planning. There are few incidences from my childhood which I remember clearly. My memory is a result of the intrinsic insecurity that always plagued me as a kid. I always looked at the world around. Those kids who owned a bicycle, the one with the training wheels that helped learn to drive by avoiding crash lands. Those classmates with clean shoes. They always charmed me. Dazzled me. My parents did no less. They gave me the best of what could be afforded. I don’t remember having told to wait for something. They always managed. It were only the expensive toys that my mom (Dad was easy to bottle and convince) denied.</p>

<p>I wanted to own every toy in sight and then break open to see how it worked. Always wanted to know how they worked. Mechanical and Electrical ones specially. Mom says when I was a kid, I almost ruined all the watches and clocks owned by the family. “You use to dip them in bucket of water“, she reports. My special interests were to take a toy, break it, pull out something which seemed useful and then make something more fun out of it. Life was all about tinkering back then (World was yet to get in “F**k You” mode of operation).</p>

<p>My usual attempts were to make the toys that I didn’t own. And the greatest joy was to understand how things worked, figure out a way to break things without damaging important parts, then a plan for the new thing to be made and finally stitch and glue everything together. And when everything worked fine, I could sleep in peace (that night). Pure joy. Sometimes I made planes (more realistic ones), rockets (also more realistic ones), boats, some LED based gun, motor based fans, windmills, turbine designs that were ruined the moment they were put in water and yet other times something totally different. If I couldn’t build anything I couldn’t understand it. And even today, I look at technology and new mechanism from same point of view. If I cannot build it in my head first, then I don’t understand it.</p>

<p>Not only making my own toys give me that immense joy of discovering but it also teaches me how to reason better. And not to forget the ability to ask deeper questions and appreciate the hidden intricacies of natural laws. Looking back, I understand what I have learnt from trying to make things is that one can be self reliant (its a choice away). And self reliance is more important than independence. Self reliance is root of mental freedom and inner peace. You could be someone’s slave but if you can find and invent solutions to your problems then you cannot be chained for too long. And that’s the key. Technology grants you just that. I hope to use it for the betterment of humanity.</p>

<p>Now, I live in a world where talking about solutions to big problems and then trying out is a daily affair. We fail usually. But then we try again. We (people) have technology in our tool-kit and only few people know how to use it. Most people are still busy in blame games. Blame the education system, the government, background, personal limits or whatever but, fact remains that few problems that plague the world at the moment can only be solved by Engineers, Innovators and Entrepreneurs. No policies can resolve them. And we have to take up the challenge of self education. The hunger has to increase because as Steve Ballmer said,</p>

<p class="blog-quote">“Everything is a technology problem.”</p>
</div>