<img class="blog-img" src="data/img/b_post8.jpg">
<h1 class="blog-title">Strange Silence</h1>
<div class="blog-body">
<p>Silence kills me. I can’t handle it if the mental chatter stops. I want it to stop but I wouldn’t know how to deal with it! I like the noise, I like high speed! I live in it and thrive. But this was very very strange, some weird digital silence. A part of me feels alive in the sense there is more time to do things and a part of me feels dead because there is no more of the phone beeping. Do I like it? May be NO but I have had realizations.</p>

<p>What had happened last night is, on my way back home I got drenched in rain. Because I had opened up my iPhone a week earlier and didn’t put the pieces back in place correctly, the water could seep in and roast the electronics. The phone got extremely hot, images of the Lithium-ion battery being on fire (on that note, Lithium is extremely active chemically and reacts violently with Oxygen) flashed in front of my eyes. I opened it up quickly to disconnect the battery from the mother board. Once the case was open I could see water droplets, a couple of them boiling. I knew that was bad and pulled the power rails off. And with that the phone died. I realized it much later, it was no longer usable.</p>

<p>Fast forward to today morning and I figured an old, black and white, basic feature phone. Trying to spend a day without smart phone is weird. A part of digital life is totally disabled. I cannot ping anyone on whatsapp, nor can anyone reach me (and I am sure everyone is wanting to reach me just today. All old and lost friends would be trying to say “Hi” just today. I must have won a lottery and they would be whatsapping me!). I can’t check my mails, I can’t text or browse, I can’t pull my phone out and just kill time. It’s like, smoking! (no I don’t smoke, I am borrowing this from friends’ experiences) I realize now. I need it! I crave for it, I want to very desperately pull the phone out, open the browser and just do something. Anything! Just something that keeps me away from the real world.</p>

<p>It took me a while to understand why all of this was happening. I had no clue what else to do with my time. The usual stuff is to pull the phone out and do whatever. This opened my eyes to a new reality of how much usable time gets wasted in sharing photos, walking through others’ profile and appreciating how others are spending their life. Now I wonder, those awesome pictures that people post are actually a symbol of loneliness. Don’t understand how, people do make time in a party to stand in a corner and get a picture of themselves clicked with an intention to maintain the digital persona. Strange but may be that is the new truth (of course it’s good to take pictures 🙂 ). Most of the text we send back and forth won’t matter 10 years from now. I don’t even remember the text sent an hour ago. It’s a plain waste of time!</p>

<p>I think I am going to learn from it and take measures to shut the unnecessary digital chatter. While it may be perceived as being left out and alone but then I will score the advantage of meeting people in person and having some human bond. The virtual reality bubble needs to go. I need to better use the time. May be read more and have some more fun, take people out on dinner. Go on a long drive and talk to myself.</p>

<p>I  miss my phone though. I think it is necessary to be able to reach out to important ones and be reachable when need be. But just the noise needs to go!</p>
</div>