<img class="blog-img" src="data/img/b_post14.jpg">
<h1 class="blog-title">Padmanabh Deshmukh</h1>
<div class="blog-body">
<p>29th of July, 2014. Evening. Around 8pm, I called him to flush my frustration. The phone rang, he attended and before I could greet “hello!” he said with a sense of relief (more like having found some water in sight when lost in a desert), “Piyush! You called me just at the right time“. I quickly felt at home, we both share the phase of struggle. He was caught in a wrong job, his dream was slipping out while I was fighting my own dark times.</p>

<p>We always felt we sailed in the same boat. But there were problems with our boat, we had no clue where it was going. We had no clue what life was doing with us, we had our plans, but life was happening and all strings seemed slipping out of hand. Worst yet, the boat had a hole in it. A leaky boat.</p>

<p>We had no cash, no mentor and a broken educational background. Wanted to do more than just exist. We lived on a hope, “If you do anything long enough, you become a master even before you know it.” Wanted to be the Gods of modern technology. And still want to. One thing was always clear, We had to work when the world was/is sleeping and that practice beats genius. Any time. I have to say, struggle was/is painful.</p>

<p>For the next few minutes all we did was laugh at how complex things had gone. He told me he was going to resign and give a fair shot at GRE once again. He had failed twice. And yet he wanted to do it, again. Sometimes, somethings in life feel just so important that you dare to do it irrespective of the consequences. You take the risk and hope everything will work out O.K. We then talked on our messed up life and inspired each other. Motivated to not give up so easily. That if we pushed little more, we might snatch from life that which is ours.</p>

<p>Six months after that phone call life changed. I am at Manipal University living my dream of being able to make toys and Padmanabh has cracked GRE, appiled to various top American Universities. The best part is, he’s getting their invitations with scholarship offers. For some strange reasons, I have this intrinsic respect for him. He deserves it!</p>

<p>We’ve got no limits. He’s still is in that messy phase though, but the gears shall change. Life shall bend and we shall move mountains and touch life. I wish him all success. That’s my greatest wish for him.</p>

<p>All green lights!</p>
</div>