<img class="blog-img" src="data/img/b_post10.jpg">
<h1 class="blog-title">Letter to a Friend</h1>
<div class="blog-body">
<p class="blog-quote">“Between the conception And the creation
Between the emotion And the response
Falls the Shadow”</p>

<p>Hi Paddy,</p>

<p>Remember the winter night? You were in the workshop, around 9:30 pm or so. Exhausted, trying to get the scissor mechanism to work. The motors had a dug, Haren had accidentally drilled a hole in his finger, Aansari had broken his forearm, hydraulic press was broke, Amruth was at all times drunk! He kept on procrastinating and lecturing you on how he was right.</p>

<p>I had just arrived with Sai and Rachit to over see while you could break for dinner. I saw that mechanism and felt it was a piece of shit. I reminded you that we had to use aluminum. It was too heavy and quite frankly it never did what we wanted it to. We looked at each other and knew we disagreed. We preferred silence. You knew I was right and I knew you were right. You wanted things to progress and I wanted them to be done right. Both were right!</p>

<p>You see, even though it was all messed up and going south, you could somehow still focus and get things to work. Make some progress and meanwhile think about the possible death of the project. We had gambled a lot! So much was at stake. But you had the fire! You had started it and for some strange reason you propelled yourself through it. Pure grace under pressure. On the other hand I was thinking to myself, “ How are we going to win this with all the garbage? Where are we heading? Whats the plan? and why is not everyone working? Whats the f**king point? We are just loosing the capital! “. I wanted to close it all and declare that we should stop it. But for some strange reasons, I just could not. I had caught the disease you had, the hunger to make something, more than normal. And above all the addiction of pursuing the joy of making things. The pleasure one gets by finding things out.</p>

<p>We looked at each other again and understood,</p>

<p class="blog-quote">“If something is important then it is ok to over-ride the consequences!”</p>

<p>The fear of failure was gone. From that moment on we worked like slaves to the clock. Made the wooden wheels and wrapped the rubber around it to cut down on expenses (Oh! remember the guy who tried to sell us the rubber? ). We used the wiper motor and crazy huge batteries (Which we misplaced on landing in Pune) to power the bot. Days rolled by, we had some blob of metal doing random stuff and some ugly looking wires hanging around. We did not give up. Persisted, packed everything together, boarded the bus, landed and competed. Sai had horrible time trying to grab the coin with the machine is a different story. But you get the point, we had made it! (I just pinged Saurabh and told him I remember those days. The response is hilarious).</p>

<p>What happened post that I am sure you haven’t forgotten. It was crazy. Looking back it was so fun. And none of that would have happened if you had not walked into the canteen and declared that we were building Bots! I owe you so much for having broken the Ice.</p>

<p>Now that you are miles away I have no clue on what your state of mind is. May be you are mentally lost, physically exhausted, stuck, surrounded by people yet alone or totally burnt out. May be you miss home (or of course you are super happy and partying). I am not sure. Whatever it is, I just wanted to remind you, I have hopes on you. I have bet on you! You cannot afford to give up.</p>

<p>Having darted yourself that far, it doesn’t make any sense to sit, think and get discouraged. There is only so much logic the brain understands, rest is pure gut. Whats the worst that can happen? Everything you worked on so hard and so long is taken away. All the sand you want to hold on to slips out and you are buried deep in the ground once again. Does it end there? Have you lost it? Got defeated? No! Not until YOU have given up. It is not over until YOU want! And there is no reason why you should spend a lot of mental horse power on issues that you won’t even remember a year from now. A sensible thing to do if you are fogged out is to find the pattern, see the dots and connect them. Choose to do what you really feel like (without fear), else you will find yourself looking at two wall clocks (if you know what I mean), again!</p>

<p>Please remember, it’s not the battle that counts, it’s the War that does.</p>

<p>Don’t think. Do it!</p>

<p>Piyush Itankar</p>