<img class="blog-img" src="data/img/b_post6.jpg">
<h1 class="blog-title">Things need to Change</h1>
<div class="blog-body">

<p>I am going to live out my life more fully. I’ve been holding myself back thinking of all the responsibilities that I have to take and account for. My parents, my job, girlfriend, car, neighbor, his parrot and what not. I’ve been bothered about being available and when the time arrived I was never in sight. In spite of being worried and all I never did and could do what is needed. I realize it now, one can’t control his environment. You don’t have to be responsible for the way the world is.</p>
<hr>
<p>Next time someone looks me into the eye hoping I am going to assume the responsibility, I think I am going to be frank and convey if I can or cannot handle it. Should save a lot of disaster later. Of course the idea is to not become an asshole in the attempt. A pinch of salt and a mix of good with self interest on top :D. I have tried to please people and it does not work well, they never get it, you become something totally different that you don’t understand and people don’t understand but because you are in the character you continue to be an ass. It’s all very confusing. Human connection goes missing somewhere in between. To begin with I think I am going to do the following:</p>

<h2>Manage Health</h2>

<p>Prolonged sitting on chair, Eight hours a day for about three years now, has ruined my body. My leg has become hard as wood. My agility and speed both are gone. I can no longer run fast and long. The fat around my belly depresses me. In fact the physical version of me I see myself becoming is so depressing. Very very depressing. At 27 I have become 85! This needs to change.</p>

<p>I am starting to workout. Starting today, I have already done some workout in morning. Slowly, I’d want to ramp up and join Gym where I can workout the right way. I am gunning for Benedict Cumberbatch level fitness. Should come with time and lots of efforts. While all that can happen, I’ll have to keep special track of my mind. It bloody fucks me up always. I think a lot about things beyond my control. A sense of fear and insecurity haunts me always. At times, even dictate my responses. These need to be controlled as well. And the way I shall do that is by not giving a F*** to what doesn’t deserve my time and attention.</p>

<h2>More Education</h2>

<p>This is one of the things I enjoy and love doing. Knowing about things help. People read newspaper, I’d like to spend time learning and doing more of Math. It’s universal and should help me with all other subjects that need it (more or less). I think I’ll also go after Physics. It should help me make better decisions. Do I want to be the guy who can solve it all? Nope. I just want to be able to enjoy the pleasure of finding things out and chasing a complex problem. Just for the fun of it.</p>

<p>If things help me in real life, then great. If not, then too bad.</p>

<h2>Better Relations</h2>

<p>I am a man of relations. Messed up relations, but yes I do bother. And I do care. Dealing with people I care for is often very exhausting. This in particular has destroyed two wonderful years of my life. I have cared and bothered too much to not hurt or just in general be protective. I think what I should do is to be and let them be. I don’t think me wanting a human connection can get me one, it’s when everyone else is ready and up for it that it’d happen. So, until then I have to be my own Man.</p>

<p>I’d love to respect people back though. I think everyone deserves to be honored. So, that is something I need to be watchful about. I am of course going to slip and get punished subtly for my way but I think I will still care. It’d also make sense to mingle a bit more with people and have lunch will fellow friends. I can make more friends and have some fun doing so. I am thinking now would be the time to get married.</p>

<p>People are important!</p>

<h2>Value add @ Work</h2>

<p>I am clear with what goes in this department. I add clarity of thought, speed of action and energy into the fix for few more years before I can become capable of take responsibilities and handle bigger teams.</p>
</div>
