<img class="blog-img" src="data/img/b_post4.jpg">
<h1 class="blog-title">The Logical Villain</h1>
<div class="blog-body">
<p>The World somehow always convinces you that in some sense you are falling behind. That you lack, your life sucks and you are the chosen one to be considered for an eternal doom. You literally need to have an infinitum of motivation to be able to override the noise. The short sellers create a level of chaos that is literally blinding if you are not quick to see through. And sadly the world is full of such people!</p>

<p>I find myself in the center of a Shakespearean tragedy. Not as a character in it but as an on looker. I am the youngest in the family and I have grown up looking at the adults operating in a complex world. Because expectations on me were always near zero, I think I have had a good chance to experiment and learn on my own. A free mind that absorbed everything that adults were doing, the way they took decisions, the way they treated each other and the way they rationalized. Little eyes were always looking and learning. It was interesting to note how in certain situations they had to decide on limited information and lot of ambiguity, people usually sat around a table and started making various theories.</p>

<p>As a kid I learnt theories are a great way to lead up to possible expected outcomes. People would reason through and think through what may and may not happen. I noticed how most of the times, the entire discussion would take an emotional turn and the theories be filled with unproven arguments. Flaws that I now understand lead to a major disasters.</p>

<p>Another important observation was/is people undergo a lot of mental stress while accounting for the emotional variables in the process. “This might happen and so He/She might feel bad”, “This might hurt Him/Her.” etc. This of course caused lot of drama. If someone’s point or view was over ridden, the person would start showing passive resistance. Looking at adults doing this over what seemed as important matters seemed silly. Looking back, I  now understand that they clearly lacked a common vision. No one knew what was the aim of living together, where was the family heading?</p>

<p>It was enough for one person to get messed up in warped version of reasoning and make illogical argument. Others would  not catch it in time and stray away from the original line of pure reasoning. People, I think get to attached with their reasoning and get offended if the reasoning is challenged. There is a part of human mind which cannot deal with it perhaps.</p>

<p>What I learned from all of this was/is one needs to be careful about one’s own line of thinking. You can’t let an idea you don’t understand fully overtake your reasoning. Feynman puts it better when he talks about cargo cult science. On the nature of experimenting and the carefulness required.</p>

<p class="blog-quote">The first principle is that you must not fool yourself—and you are the easiest person to fool.  So you have to be very careful about that.  After you’ve not fooled yourself, it’s easy not to fool other scientists.  You just have to be honest in a conventional way after that.
<br>
- RICHARD P. FEYNMAN
</p>
<p>I’ve tried to live by this principle ever since I got to know it. It’s so profound and deep. And applies to daily life very well. For any decision you are about to take, if you fool yourself to arrive at a conclusion other than where the data and evidence is naturally leading, you are doing yourself no good. Things will sure be all hunky-dory for a while and soon fall apart for the worst. The downside of fooling yourself is you tend to fool others by passing the tampered line of reasoning, and that way pose a potential harm to your credibility and trust that others have in you.</p>

<p>Sure you can save it all by realizing in time and admitting the screw-ups, but who does that? I’ve noticed people do not like admitting that they are screwing up. They rather cook up all sort of reasons why they might be right. And because reasoning is not a black and white kind of affair, usually they do have a grain of truth in argument. Filtering that is hard. And on top of that pointing out the flawed points make them mad, sad and irritated. Once you have irritated  person enough, you have signed up to become a Villain.</p>

<p>I don’t entirely understand how to behave in such situations. It hurts though that people don’t take the responsibility of thinking through multiple layers. And trying to help them correct the line of thinking gets me in their way. Then what happens? The trust in me is put on toss, me not answering a question is taken as ‘Okay’ to proceed with their plans and there is occasional emotional pistol whip-lashing.</p>

<p>I am again an on looker with a hope to not witness a crash.</p>
</div>