<img class="blog-img" src="data/img/b_post7.jpg">
<h1 class="blog-title">What after Mum and Dad?</h1>
<div class="blog-body">
<p>Every morning I look at them. I am thankful that I have them. Then I feel sad, they are growing old. And growing old fast. My Mum’s jet black hair have now turned black. Dad has slowed down on his pace of doing things. It’s hard to believe and is a visit to an alternate universe.</p>

<p>Everyday that goes by scares the shit out of me. Both of them ar senior citizens and i am always worried that the immune system is going down, the body is tending to give up etc etc. Call me a pessimist but I am not. It’s just too hard for me to accept. Last I properly saw them, both were young and taking life head on. Eight years later when I am back and living with them I realize,</p>

<p class="blog-quote">Life has happened!</p>

<p>What adds to the trouble is I haven’t still grown up enough. I do feel sad they lost their first Son. How they handled that loss I have no clue. If he had been around, may be they would be travelling the world (or could be suffering even more!). They would have a responsible Son taking care of things. This reminds me every morning that I have a mental lag of about 10 years! I need to grow up fast. And quite frankly this is consuming me!</p>

<p>I am trying to gather up a madening pace. Pace of learning, executing and analysing. I do feel sometimes it’s take a toll on me, my brain has become popcorn of sorts, it’s just mad to consume lot of information and try hard to ASAP convert it to Knowledge. A part of my brain has lost it’s capacity to figure when to use logic and when to handle things emotionally. Living in a place where logic isundervalued I come out to the world as a rude and mean person. But I do not have any such intention. My vehicle of choice to navigate through the world is Logic which seem to have lot of downsides. What happens because of trying to look for logic is I listen to an argument and towards the end I figure that the cause and effect sequence proposed is depended on luck, chance, God, positions of Star etc. It frustrates me. I have been given all of this data, I spent my energy listening to it, undivided attention and thenI discover that there is nothing I can do with that data. It’s un reliable. It makes me angry.</p>

<p class="blog-quote">It makes me feel alone!</p>

<p>While I am trying to cope with such things and grow up there is something I absolutly love. I love taking them out. I go on a drive with Dad on Sundays (not these days though), we pull over next to a crater and we talk. It’s usually me talking and my Dad listening and appreciating my plans. He doesn’t really care. I understand that part of him. He just wants me to live without him. Which at some point I feel is square and fare. He likes to see me and my sister do well. When asked for any advice he has none! “Go try it out and try not to screw up” is what he conveys.</p>

<p>As with my mother. I fight with her! we are constantly in an argument and opposing each other’s world view. I am still an unhatched egg for her! I take her shopping, to the hospital to be the translator between the Doc and her. We usually have chats together whenever things fall in place and my brain is in place in spite the horrible traffic. What I have learnt from my mother is how to be a Falcon. How to protect your folks and tear down anything that stands in the way. I respect her deeply and she is my hero!</p>

<p>These guys are my favorite. I am trying hard to be a good Son. Their generation has different world view and mine is a totally different one. I am trying to see how the world looks when seen from their eyes. I just hope that they enjoy some more. Life has been rough, I want to make it joyful now. And the window of opportunity is small!</p>

<p>What happens after them I really don’t know. May be I’ll cook up a family organically, where everyone respects and trusts eachother. Where people would miss eachother when distance apart. And may be I’ll spend time loving and inventing new stuff.</p>