<img class="blog-img" src="data/img/b_post11.jpg">
<h1 class="blog-title">Heaven-Hell-Heaven</h1>
<div class="blog-body">
<p>Yesterday, while I was writing about my room mates and graduation life. I got a message from a guy asking for my number. I gave him my number and soon he called me. I took the call had a general talk. He told me he was following my posts from quite sometime and he liked them. I felt good. I mean seriously, in a partly sucking life, someone comes along and tells you what you are doing seems good. You feel good (if not anything else). After that he hung the call.</p>

<p>Now here’s the interesting part. He called me back after dinner. We started off with cracking some technical jokes and soon he started to share his experience of life. His story is unbelievable. Seemed unrealistic but for reasons I do not fully understand I trusted it was all true. Sometime real life is strange than fiction. You just have to hope and pray, and deal with it.</p>

<p>He was sharing stories of his rough times with me, and laughing simultaneously. I guess that is what one does if he/she survives something that brought them close to psychological breakdown. Laugh! Kind of you feel strong. In any case, he shared that there were times when life seemed hopeless, everything he did was wrong, worsened things even more and apart from everything else felt lonely. Being surrounded by the crowd yet alone! In fact he was so sick and tired of dealing with it that he decided to go and end his life. End of life, end of mess.</p>

<p>One not so fine day, he walks down to a lake and is on the edge to jump in. Only when he is about to jump someone calls out his name. A friend by the name Santosh who happens to be hanging around. Just comes along to talk not knowing that he has aborted a suicide in progress. Bear with me if this sounds more like fiction. It’s not.</p>

<p>I have to say this, I am running out of right words to express things and I would like to type down what became of this guy who survived. Well, from that day he got serious about things. He cleared all his exams and backlogs (he had 15 of them. All cleared in an exam sequence of 16 day straight.), he got a sucking job in order to pay back the loans he had taken and today he’s off the Indian shore earning well and paying and closing debts. Life’s paying him back for the courage he had/has (I don’t know better words to put it).</p>

<p>The final thing he said was, “My life is like this, HEAVEN-HELL-HEAVEN“. “Binary!”, I replied jokingly. He laughed, talked some more and then asked if he could hang the call, he wanted to talk to the lady he seemed to love most. His gonna be wife. Then he hung the call.</p>

<p>I got back to my room and reflected on all that he had said. I liked his story. And then wondered why he chose me? Last I remember is I drifted off to sleep while staring at the ceiling fan in my room.</p>

<p>And here’s what I learned :

    <ul>
        <li>Success and Failure is a choice. You choose to be Successful or the default is failure.</li>
        <li>Do your best. Let life do the rest.</li>
        <li>When you have survived a screw-up you laugh more (probably because you know you are strong. More than what you expected yourself to be.).</li>
        <li>What doesn’t kill you. Makes you stronger.</li>
        <li>And at the end, you become truly wise.</li>
        <li>His story is not something one can put in words. Words somehow ruin the whole flavor. I’ll carry it with me and possibly share personally with the one who would need it.</li>
    </ul>
</p>
</div>