<img class="blog-img" src="data/img/b_post1.jpg">
<h1 class="blog-title"> Pleasure and Pain </h1>
<div class="blog-body">
<div class="blog-quote">You prepare for the future, plan for it and if it happens it has to be yours!</div>
<p>
Nothing is in particular running through my mind at the moment. I was just contemplating on the importance of playing long term and not loosing the focus for short term gain. Pleasure is a tricky business, one that most of us are driven by. Where did that come from? Hang on, it gets better.
</p>
<p>
While I was going through a course in Law, there was one particular lecture that talked about what guides us towards what is right and what is not, What we call “gut feeling” in day-to-day life. After an interesting debate it was apparent that a Man (and a Women, all the Human beings for that matter) are guided in someway by pleasure and pain. We usually strive to maximize pleasure and minimize pain. The question then stands, how do we decide what gives pain and what gives pleasure? The answer is very interesting! Given an option to choose one out of two experiences, after having experienced both, people usually choose the one that maximizes pleasure or minimizes the pain. By default! Consider for example you taste (for the first time in life, say) an Orange and a bitter Gourd, there is a significant chance that you’ll pick the Orange the next time you are asked. Convinced?
</p>
<p>
My claim is that this “attempting to optimize” behavior governs our daily life. All those small actions we take every day are in some or the other sense guided by this proposition. While maximizing the pleasure seems the right thing to do, trying to minimize the pain can have certain long term consequences which we don’t realize right away. Consider for example, most of those I know don’t go to the Gym or otherwise don’t exercise on daily basis for the pleasure of being in the Bed for a little longer. The effects of such decisions come much later in life, when one falls sick.
</p>
<p class="blog-quote">
Health is a crown on a healthy man’s head that only a sick person can see!
</p>
<p>
But it’s too late to go to Gym by them. People usually get engulfed into a deep misery because their kids are yet to grow up or the finances are not in place or whatever. A greater misery is that their family has to suffer too. It’s a huge pain. Whats the learning for all of this? Our actions are mostly governed by pleasure and pain. So what about it?
</p><p>
Well, no one really knows whats the purpose of life, why we are here etc etc. We do know though that with time, energy, resources, health, connection and even loved ones reduce in number. And this kind of has a very depressing impact. You don’t die but rather live a depressed life. Of course one day we all shall die. But I think it makes sense to die gracefully. To close our eyes forever while not shaking the families too much out of place. I think that’d be much more respected and remembered by those left behind.
</p><p>
The point I am trying to drive home is while we try to maximize pleasure, it makes much more sense to optimize it for the duration rather than for the quantity. I’d prefer small happiness for longer duration vs a much more bigger in magnitude kind of happiness. I am not sure anything I write would convince the exact point but may be another example can help, what would make you more happy? A puppy running around in the house, shaking it’s tail and jumping the moment it sees you or winning a lottery (equivalent to say, 20% of your salary/monthly income. And of course we assume you are not bankrupt!).
</p><p>
I am not sure about yours but my true motivation of daily living these days seem to be in – planning out ways to span out the pleasure over longer duration and reducing the spikes of pain that might occur in future (which of course are bound to occur). This also sounds to me like the fundamental idea of distributing risk. You save a part of your sunny day for a rainy day. You never know what can go wrong and having redundancy in guarding against the pain just helps (which is another way of saying having multiple reasons to be relaxed at any point in time).
</p><p>
While a good deal of my present day continue to be miserable, I think I am pretty focused on planning out risk reduction for the future. The fact that every day in some sense is being spent towards building a solid base for the future keeps me going. I am convinced that the right thing to do and one that shall bring a lasting pleasure.
</p><p>
Once I am through this phase I never really want the depression cycles to repeat. Ever! I’d always spot them before hand most of the time and diffuse the impact. I think that’s the way to go… And of course I’d have maximized the risk of some Joker judging me – “Your life is not adventurous. It’s not happening and you have missed out on living”. I know such opinions won’t affect me.
</p><p>
I know the difference between madness and adventure.
</p>
</div>