<img class="blog-img" src="data/img/b_post12.jpg">
<h1 class="blog-title">Bet’s on Rex!</h1>
<div class="blog-body">

<p class="blog-quote">I walked towards his bed, sat on the chair next to the table and asked,”Choose a date paaji”. “17th April 2017”, he replied and meanwhile I threw him a devil smile. “What for?”, he asked in confusion, with his left eyebrow going up. “We’ll visit Lamborghini, Sant’agata, Italy“. We both looked at each other with affirmation…</p>

<p>Rachit is one person I know who has the courage to nurture a wild dream. Really wild one. Of owning and working in Lamborghini. He works with Carbon fibers already. Carbon fibers are lighter than steel and orders of magnitude stronger than it. This material is what a Lambo is made of. He draws it blindly and possibly knows all its dimensions.</p>

<p>You know, I am proud to having spent four years of my life with him and Sai (A post on Sai is in coming too).  Pure bliss. It occurs to me today that these guys are Titans. It’s inbuilt in them. They have this attitude and passion about their dreams. They just don’t dream, they sacrifice the fun and do what’s right versus what feels right. When they work, they turn reality inside out. There are problems that plague Rachit’s life, but chuck that for a moment. My point is simply this, Rachit is going to own and build a Lamborghini. And I can tell this with absolute certainty. No doubt.  …It’ll take time… and he’ll be torn down (he’ll survive. He has been through worse, that too unprepared) but, …he’ll make it.</p>

<p>Even though we decided some two or three odd years ago that we’ll visit Italy together, I see the hope of that happening. 2017 is two years from today. I need to gear up my life. Work twice as smart and hard. My biggest wish is to visit with him Lamborghini, Sant’agata, Italy.  I owe him that respect for his efforts, strength of character , passion and the burning desire to build.  And we shall do it. We’ll make it big! </p>

<p>My bet is on him. Let the count down begin. Period.</p>
