<img class="blog-img" src="data/img/b_post5.jpg">
<h1 class="blog-title">Lost Mariner</h1>
<div class="blog-body">
<p class="blog-quote">
If you leave Important things at the mercy of unimportant things, then you are heading for the crater!
</p>

<p>Lately, I’ve been thinking what is the long term vision of all that I’ve been doing? My singular focus until now was happy families, fine health and a level of automated financial freedom where no one in the family has to think about any financial plans before they jump in and do something. It’s like if you get an idea and want to do something about it and it’s going to cost, simply go and do it! And I believe that’s what everyone’s life should be about, you should build a framework around you which is automatic for the most part, requires least maintenance (you don’t want to get back to the model in your Fifties and then fix it or revamp it again. Makes no sense, you are going to be low on energy and high on responsibilities. Like it or not it’s going to be there… ) and supports the kind of life you wanted to live.</p>

<p>Sadly, I find myself surrounded with people who think differently. They have dreams, but the plan to work on it seems absent, worst yet they don’t even seem to make one to work on. What I see instead happening is settling for the short term benefits. Falling for the short term desires. The short lasting pleasure that is soon forgotten in the hidden trap they signed up for.</p>

<p>I’m being repeatedly told that I think too much negative. No, I don’t! I just speak my mind out loud usually and put all my worries into words thinking those who care will take the effort to say, ‘wait! you know what? So and so which you think cannot happen because this and this assumption is incorrect because of such and so’, my belief is that such conversations improve the intelligence of people involved in the debate and usually leads to making them smart to take much more complex decisions in future. Also you can rightly guide the juniors who follow you. Besides, it’s a no brainier, it’s because I care that I choose to wallow in the misery of thinking through all the possible ‘ifs’ and ‘buts’ that need to be dealt with to reach the destination.</p>

<p>Sounds to me like going to War and be like, ‘Well, we’ll just go and we are going to win!’ or like, ‘We’ll just go and see what to do there… ‘. If you go to War with that attitude and level of planning, not only are you going to get killed, but you have others who believed in you who are going to get killed because of you! A lot is riding on you! Life is not a War but I do feel it by default is much more powerful (Entropy works against desire, mostly!), I can never put it better than Robert Kiyosaki –</p>

<p class="blog-quote">Life will crush you like a Cockroach that you are!</p>

<p>To me it matters to have plans and by that I mean pin-pointed ones, to move with a purpose and feel you are special. And that if not anyone then your own children should feel great about you having graced this planet.</p>

<p>I do not wish to be lost. I need put my ego aside and give way to what matters more, Health, Education, Relations and Wealth. For the world around me, it can always choose to plan a better vacation/holiday than plan for self improvement and well being. And too that purpose, I am going to set my priorities right.</p>
</div>